examples/square2D_VIV_multiprocessing/env04/0/Uf_0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceVectorField;
    location    "10";
    object      Uf_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
36597
(
(2.0000259 -0.00056041273 0)
(2.0002547 -0.000825696 0)
(2.0000131 -0.0006569075 0)
(2.0000972 -0.0013889486 0)
(2.000014 -0.00081416836 0)
(2.0001606 -0.0015224565 0)
(2.0000084 -0.00089567402 0)
(2.0000849 -0.0018510933 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (2 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
134
(
(2.0277864 -0.017847314 0)
(2.0287034 -0.01671818 0)
(2.0304437 -0.016419719 0)
(2.03225 -0.01541674 0)
(2.0344084 -0.014929751 0)
(2.0365661 -0.014022967 0)
(2.0388847 -0.013425302 0)
(2.041147 -0.01259494 0)
...
)
;
    }
    syms
    {
        type            calculated;
        value           nonuniform List<vector> 
294
(
(2.0000511 -0.00030571481 0)
(2.0004575 -0.0011863945 0)
(2.0011996 -0.0022379504 0)
(2.0022124 -0.0034129565 0)
(2.0034716 -0.0046729879 0)
(2.0049463 -0.0059756576 0)
(2.0065935 -0.0072744848 0)
(2.0083671 -0.0085272794 0)
...
)
;
    }
    front1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    middle1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    middle2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(1.9593826e-08 0.43174889 -1.3242136e-33)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
(0 0.43174889 0)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
