examples/square2D_VIV_multiprocessing/env04/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

patches     (cylinder front1 front2 middle1 middle2 back1 back2);

rho         rhoInf;
rhoInf      1;

magUInf     2;
lRef        0.0508;	
Aref        0.0508;

liftDir     (0 1 0);
dragDir     (1 0 0);

CofR        (0 0 0);
pitchAxis   (0 0 1);

#includeEtc "caseDicts/postProcessing/forces/forceCoeffsIncompressible.cfg"

// ************************************************************************* //
